@extends('layouts.app')
@section('content')
<div class="index">
    <h1>
        <a href="{{route('expenses.create.view')}}">مشاهده فرم ایجاد هزینه کرد</a>
    </h1>
    <h1>
    <a href="{{route('expenses.view')}}">مشاهده لیست هزینه کرد ها</a>
    </h1>
    <h2>نکته</h2>
    <h3>حتما از seeder استفاده کنید</h3>
    <h3>از طریق پستمن نیز میتوانید از ای پی آی استفاده کنید</h3>
    <h3>email, schedule بصورت صف توسعه داده شده اند و در صورت ایجاد ، در جدول jobs قابل مشاهده هستند.</h3>
    <h3>نتیجه انجام عملیات های پرداختی بصورت لاگ در laravel.log قابل مشاهده هستند.</h3>
    <h3>برای اجرای فرانت از چت جی پی تی کمک گرفته شده همانگونه که در داکیومنت اشاره شده بود در این تست فرانت اهمیت خاصی ندارد و کد های بکندی معیار هستند.</h3>
    <h3>php artisan storage:link نیز اجرا گردد</h3>
</div>
@endsection
